_posts/2013-06-07-symfony2-behat-check-checkbox-if-not-checked-yet-with-onclick-event.html
---
layout: post
title: Symfony2 Behat - check checkbox if not checked yet (with onclick event)
date: 2013-06-07 11:03:31 UTC
updated: 2013-06-07 11:03:31 UTC
comments: true
category: programming
tags: [symfony2, php, behat, testing]
---
{% include JB/setup %}

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">'I check "checkbox\<sub>id</sub>"' doesn't work for me</h2>
<div class="outline-text-2" id="text-1">
<p>
Behat includes method for checking checkboxes, but it have one disadvantage - when it is run on Selenium server
it only tacks checkbox value but don't fire onclick event. I write some small snippet to handle this flaw.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Code snippet</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-php"><span style="color: #5f7f5f;">/**</span>
<span style="color: #5f7f5f;"> * </span><span style="color: #b0deff; background-color: #0b0b0b;">@When</span><span style="color: #5f7f5f;"> /^I check "([^"]*)" if not checked yet</span><span style="color: #ffffff;">$</span><span style="color: #5f7f5f;">/</span>
<span style="color: #5f7f5f;"> </span><span style="color: #5f7f5f;">*/</span>
<span style="color: #f0dfaf; font-weight: bold;">public</span> <span style="color: #f0dfaf; font-weight: bold;">function</span> <span style="color: #a2d7fb;">iCheckIfNotCheckedYet</span>(<span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">id</span>)
{
    <span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">Page</span> = <span style="color: #ffffff;">$</span><span style="color: #b0deff;">this</span>-&gt;<span style="color: #cfcfcf; background-color: #1f1f1f;">getSession</span>()-&gt;<span style="color: #cfcfcf; background-color: #1f1f1f;">getPage</span>();
    <span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">isChecked</span> = <span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">Page</span>-&gt;<span style="color: #cfcfcf; background-color: #1f1f1f;">find</span>(<span style="color: #a5a5a5;">'css'</span>, <span style="color: #a5a5a5;">'input[type="checkbox"]:checked#'</span> . <span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">id</span>);
    <span style="color: #f0dfaf; font-weight: bold;">if</span> (!<span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">isChecked</span>) {
        <span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">Page</span>-&gt;<span style="color: #cfcfcf; background-color: #1f1f1f;">find</span>(<span style="color: #a5a5a5;">'css'</span>, <span style="color: #a5a5a5;">'#'</span> . <span style="color: #ffffff;">$</span><span style="color: #e2b1f4;">id</span>)-&gt;<span style="color: #cfcfcf; background-color: #1f1f1f;">click</span>();
    }
}
</pre>
</div>

<p>
It checks if checkbox is checked, if not it fire click action on it.
</p>
</div>
</div>
